; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v9 ?v12)
             (pred_7 ?v8 ?v3)
             (pred_6 ?v9 ?v3)
             (pred_3 ?v1 ?v9 )
	     (pred_2 ?v9)
             (pred_12 ?v11)
             (pred_5 ?v8)
             (pred_9 ?v3)
             (pred_1 ?v9)
             (pred_11 ?v8)
             (pred_4 ?v9)
             (pred_8 ))



(:action op_3
:parameters (?v2 ?v6 ?v4 ?v13)
:precondition (and (pred_12 ?v2) (pred_12 ?v6) (pred_5 ?v4) (pred_9 ?v13)
          (pred_10 ?v2 ?v6) (pred_7 ?v4 ?v13)
                   (pred_6 ?v6 ?v13) (pred_2 ?v2) 
                   (pred_1 ?v6) (pred_11 ?v4))
:effect (and  (pred_4 ?v6) (not (pred_1 ?v6))))


(:action op_1
:parameters (?v2 ?v10)
:precondition (and (pred_12 ?v2) (pred_12 ?v10)
               (pred_2 ?v2) (pred_10 ?v2 ?v10) (pred_4 ?v10))
:effect (and (pred_2 ?v10) (not (pred_2 ?v2))))

(:action op_4
:parameters (?v2 ?v4)
:precondition (and (pred_12 ?v2) (pred_5 ?v4) 
                  (pred_2 ?v2) (pred_3 ?v4 ?v2) (pred_8 ))
:effect (and (pred_11 ?v4)
   (not (pred_3 ?v4 ?v2)) (not (pred_8 ))))


(:action op_2
:parameters (?v2 ?v5 ?v7)
:precondition (and (pred_12 ?v2) (pred_5 ?v5) (pred_5 ?v7)
                  (pred_2 ?v2) (pred_11 ?v7) (pred_3 ?v5 ?v2))
:effect (and (pred_11 ?v5) (pred_3 ?v7 ?v2)
        (not (pred_11 ?v7)) (not (pred_3 ?v5 ?v2))))

(:action op_5
:parameters (?v2 ?v4)
:precondition (and (pred_12 ?v2) (pred_5 ?v4) 
                  (pred_2 ?v2) (pred_11 ?v4))
:effect (and (pred_8 ) (pred_3 ?v4 ?v2) (not (pred_11 ?v4)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_03 obj_18 obj_13 obj_10 obj_17 obj_20 obj_09 obj_11 obj_01 obj_15 obj_02 obj_05 obj_14 obj_19 obj_06 obj_04
    obj_16 obj_12
    obj_08 obj_07
    )

    (:init
       (pred_8)

       (pred_12 obj_03)
       (pred_12 obj_18)
       (pred_12 obj_13)
       (pred_12 obj_10)
       (pred_12 obj_17)
       (pred_12 obj_20)
       (pred_12 obj_09)
       (pred_12 obj_11)
       (pred_12 obj_01)
       (pred_12 obj_15)
       (pred_12 obj_02)
       (pred_12 obj_05)
       (pred_12 obj_14)
       (pred_12 obj_19)
       (pred_12 obj_06)
       (pred_12 obj_04)
       (pred_9 obj_16)
       (pred_9 obj_12)
       (pred_5 obj_08)
       (pred_5 obj_07)

       (pred_10 obj_03 obj_17)
       (pred_10 obj_03 obj_18)
       (pred_10 obj_18 obj_20)
       (pred_10 obj_18 obj_13)
       (pred_10 obj_18 obj_03)
       (pred_10 obj_13 obj_09)
       (pred_10 obj_13 obj_10)
       (pred_10 obj_13 obj_18)
       (pred_10 obj_10 obj_11)
       (pred_10 obj_10 obj_13)
       (pred_10 obj_17 obj_01)
       (pred_10 obj_17 obj_20)
       (pred_10 obj_17 obj_03)
       (pred_10 obj_20 obj_15)
       (pred_10 obj_20 obj_09)
       (pred_10 obj_20 obj_18)
       (pred_10 obj_20 obj_17)
       (pred_10 obj_09 obj_02)
       (pred_10 obj_09 obj_11)
       (pred_10 obj_09 obj_13)
       (pred_10 obj_09 obj_20)
       (pred_10 obj_11 obj_05)
       (pred_10 obj_11 obj_10)
       (pred_10 obj_11 obj_09)
       (pred_10 obj_01 obj_14)
       (pred_10 obj_01 obj_15)
       (pred_10 obj_01 obj_17)
       (pred_10 obj_15 obj_19)
       (pred_10 obj_15 obj_02)
       (pred_10 obj_15 obj_20)
       (pred_10 obj_15 obj_01)
       (pred_10 obj_02 obj_06)
       (pred_10 obj_02 obj_05)
       (pred_10 obj_02 obj_09)
       (pred_10 obj_02 obj_15)
       (pred_10 obj_05 obj_04)
       (pred_10 obj_05 obj_11)
       (pred_10 obj_05 obj_02)
       (pred_10 obj_14 obj_19)
       (pred_10 obj_14 obj_01)
       (pred_10 obj_19 obj_06)
       (pred_10 obj_19 obj_15)
       (pred_10 obj_19 obj_14)
       (pred_10 obj_06 obj_04)
       (pred_10 obj_06 obj_02)
       (pred_10 obj_06 obj_19)
       (pred_10 obj_04 obj_05)
       (pred_10 obj_04 obj_06)
       (pred_1 obj_10)
       (pred_1 obj_18)
       (pred_6  obj_10 obj_16)
       (pred_6  obj_18 obj_12)
       (pred_4 obj_03)
       (pred_4 obj_13)
       (pred_4 obj_17)
       (pred_4 obj_20)
       (pred_4 obj_09)
       (pred_4 obj_11)
       (pred_4 obj_01)
       (pred_4 obj_15)
       (pred_4 obj_02)
       (pred_4 obj_05)
       (pred_4 obj_14)
       (pred_4 obj_19)
       (pred_4 obj_06)
       (pred_4 obj_04)

       (pred_7  obj_08 obj_16)
       (pred_7  obj_07 obj_12)
       (pred_3 obj_08 obj_18)
       (pred_3 obj_07 obj_19)
       (pred_2 obj_02)
    )

    (:goal (and
       (pred_3 obj_07 obj_13)
    ))
(:constraints
  (always (not (pred_2 obj_15)))
)
)

; plan
1. (op_1 obj_02 obj_06)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_06)
   goals met: 0 of 1
2. (op_1 obj_06 obj_19)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_19)
   goals met: 0 of 1
3. (op_4 obj_19 obj_07)
   deleted: (pred_3 obj_07 obj_19) (pred_8)
   added: (pred_11 obj_07)
   goals met: 0 of 1
4. (op_1 obj_19 obj_06)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_06)
   goals met: 0 of 1
5. (op_1 obj_06 obj_02)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_02)
   goals met: 0 of 1
6. (op_1 obj_02 obj_09)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_09)
   goals met: 0 of 1
7. (op_1 obj_09 obj_13)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_13)
   goals met: 0 of 1
8. (op_5 obj_13 obj_07)
   deleted: (pred_11 obj_07)
   added: (pred_8) (pred_3 obj_07 obj_13)
   goals met: 1 of 1
